Revit 2027 API
BuiltInFailures.FamilyFailures.CannotLoadMetricFamilyToImperialProject Property
 Can't load a metric Family into an imperial Project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotLoadMetricFamilyToImperialProject { get; }
Public Shared ReadOnly Property CannotLoadMetricFamilyToImperialProject As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotLoadMetricFamilyToImperialProject {
	FailureDefinitionId^ get ();
}
static member CannotLoadMetricFamilyToImperialProject : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace